:PROPERTIES:
:ID:       87874ebe-b9c7-4243-a018-4e940b993adc
:END:
#+TITLE: Guix: Configure udev to lock screen on yubikey removal
#+CATEGORY: slips
#+TAGS:  

I just realized that what I'm going for is close to the [[https://www.youtube.com/watch?v=9BW-mbC7Xag&pp=ygUMc3VuIHJheSB0aGlu][hotdesking on Sun's
sadly failed Solaris-based Sun Ray thin-clients]].

**** Listing Sessions to lock

This emits quotes and requires =jq= which IMO root need not have by default
(does it really matter though?)

#+begin_example sh
loginctl list-sessions -o json -P uid \
  | jq '.[] | @text "\(.session) \(.uid)"'
  | tr -d'"'
#+end_example

Another option (apparently this easily works over Tramp SSH)

#+begin_src sh
loginctl show-user 1000 \
    | grep -e "^Sessions=" \
    | sed -e 's/Sessions=//g'
#+end_src

#+RESULTS:
: 2

=loginctl= options allow you to conduct this filtering, though a script needs to
query on pscsd, scdaemon, etc... to obtain the correct user's id for the removed
Yubikey device. 

#+begin_src sh
loginctl show-user $(id -u) --property Sessions --value
#+end_src

#+RESULTS:
: 2

